<a href="https://colab.research.google.com/github/katrielaraujo/SQL-dataquest/blob/main/Basics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

In [ ]:
%%sql
SELECT *
  FROM sqlite_master
 WHERE type='table';

Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [ ]:
%%sql
SELECT *
  FROM facts
 LIMIT 5

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

In [ ]:
%%sql
SELECT MIN(population) AS Min_population,
       MAX(population) AS Max_population,
       MIN(population_growth) AS Min_growth,
       MAX(population_growth) AS Max_growth
  FROM facts

Done.

[(0, 7256490011, 0.0, 4.02)]

In [ ]:
%%sql
SELECT name AS min_population
FROM facts
WHERE population = (SELECT MIN(population) FROM facts);

Done.

[('Antarctica',)]

In [ ]:
%%sql
SELECT name AS max_populatin
FROM facts
WHERE population = (SELECT MAX(population) FROM facts);

Done.

[('World',)]

In [ ]:
%%sql
SELECT MIN(population) AS min_population,
       MAX(population) AS max_population,
       MIN(population_growth) AS min_growth,
       MAX(population_growth) AS max_growth
  FROM facts
 WHERE name <> 'World'

Done.

[(0, 1367485388, 0.0, 4.02)]

In [ ]:
%%sql
SELECT AVG(population) average_population,
       AVG(area) average_area
  FROM facts
 WHERE name <> 'World'

Done.

[(32242666.56846473, 555093.546184739)]

In [ ]:
%%sql
SELECT population,area
  FROM facts
 WHERE population > (SELECT AVG(population)
                      FROM facts
                      WHERE name <> 'World')
 WHERE area < (SELECT AVG(area)
                 FROM facts
                WHERE name <> 'World')

(sqlite3.OperationalError) near "WHERE": syntax error
[SQL: SELECT population,area
  FROM facts
 WHERE population > (SELECT AVG(population)
                      FROM facts
                      WHERE name <> 'World')
 WHERE area < (SELECT AVG(area)
                 FROM facts
                WHERE name <> 'World')]
(Background on this error at: http://sqlalche.me/e/13/e3q8)